app/controllers/course_modules_controller.rb

  def show
    @content     = @module.course_content
    @vids        = @content.course_videos.sorted
    @video       = CourseVideo.find_by_id(params[:video]) || @vids.first
    @quizz       = @module.quizz
    @supporting_images = @module.supporting_materials.joins(:image)
    @supporting_docs   = @module.supporting_materials.joins(:document)
    # there should only be 1 conversation exist for the same user for the same module
    @conversation = Conversation.by_module(@module).sent_by_member(current_user).first
---
SELECT  `course_videos`.* FROM `course_videos` WHERE `course_videos`.`id` IS NULL LIMIT 1
SELECT `supporting_materials`.* FROM `supporting_materials` INNER JOIN `document_files` ON `document_files`.`documentable_id` = `supporting_materials`.`id` AND `document_files`.`documentable_type` = 'SupportingMaterial' WHERE `supporting_materials`.`course_module_id` = 1
SELECT  `course_contents`.* FROM `course_contents` WHERE `course_contents`.`course_module_id` = 1 LIMIT 1
SELECT `supporting_materials`.* FROM `supporting_materials` WHERE `supporting_materials`.`course_module_id` = 1

  def set_module_context
    @module = CourseModule.find_by_id(params[:id])
---
SELECT  `course_modules`.* FROM `course_modules` WHERE `course_modules`.`id` = 1 LIMIT 1