app/controllers/quizzes_controller.rb

SELECT  `quizz_questions`.* FROM `quizz_questions` WHERE `quizz_questions`.`quizz_id` = 1  ORDER BY `quizz_questions`.`id` ASC LIMIT 1
SELECT `quizz_answers`.* FROM `quizz_answers` WHERE `quizz_answers`.`id` IN (1, 2)
INSERT INTO `quizz_attempts` (`user_id`, `quizz_id`, `correctly_answered`, `passed`, `created_at`, `updated_at`) VALUES (1, 1, 1, 0, '2017-03-08 02:32:41', '2017-03-08 02:32:41')
---
  def submit
    correct_question_ids = []
    params[:question].each do |q, a|
      question = QuizzQuestion.find_by_id(q)
      answers  = QuizzAnswer.where(id: a).sort
      if answers == question.answers.correct.sort
        correct_question_ids << q.to_i
      end
    end

    passed = @quizz.have_passing_score?(correct_question_ids.size)
    # add quizz attempt transactions
    QuizzAttempt.create!(user: current_user, quizz: @quizz, correctly_answered: correct_question_ids, passed: passed)

SELECT  `course_modules`.* FROM `course_modules` WHERE `course_modules`.`id` = 1 LIMIT 1
SELECT  `quizz_questions`.* FROM `quizz_questions` WHERE `quizz_questions`.`quizz_id` = 1  ORDER BY `quizz_questions`.`id` ASC LIMIT 1
---
  def set_quizz_context
    @module = CourseModule.find_by_id(params[:id])
    unless @module.present?
      flash[:alert] = 'Sorry, module not found!'
      redirect_to :back and return
    end

    @quizz     = @module.quizz
    @questions = @quizz.questions.includes(:answers)
    @question  = QuizzQuestion.find_by_id(params[:question_id]) || @questions.first