app/controllers/units_controller.rb

  def index
    @units = Unit.sorted
    if current_user.present?
      @completed = current_user.completed_modules.size
      @total     = CourseModule.all.size
---
SELECT COUNT(*) FROM `course_modules`