app/controllers/users/users_controller.rb

  def profile
    @user = if current_admin.present?
      User.find_by_id(params[:user_id])
    else
      current_user
    end

    if @user.nil? || (current_admin.nil? && @user != current_user)
      flash[:alert] = 'Sorry, user not found!'
      redirect_to :back and return
    end

    # ============ Payment Related Stuff ==================
    # track the visits to payment page
    activity = ActivityTracker.find_or_initialize_by(email: cookies["email"], key: 'checkout.visit')
    promo = Promotion.find_by_id(cookies.encrypted[:promotion_id])
    activity.parameters = {promotion_id: promo.id, discount: promo.label}
    activity.save

    @product = Product.first
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
SELECT  `products`.* FROM `products`  ORDER BY `products`.`id` ASC LIMIT 1

  def update
    current_user.update(
    params.require(:user).permit(:first_name, :last_name, :time_zone))
---
UPDATE `users` SET `first_name` = 'Tutrain', `last_name` = 'Successful', `updated_at` = '2017-03-03 23:14:40' WHERE `users`.`id` = 1

  def charge
    product = Product.find_by_code(params[:product_code])
    promo   = Promotion.find_by_id(params[:promo_id])

    user = if User.find_by_email(params[:user][:email]).nil?
      temp_pw = Devise.friendly_token
      User.create!(
        email:                 params[:user][:email],
        password:              temp_pw,
        password_confirmation: temp_pw,
        temprorary_password:   true
      )
    else
      User.find_by_email(params[:user][:email])
    end

    user.first_name = params[:user][:first_name]
    user.last_name  = params[:user][:last_name]
    user.zipcode    = params[:user][:zip]
    user.save!
---
SELECT  `products`.* FROM `products` WHERE `products`.`code` = 'ACCTMKT' LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'testcard@gmail.com' LIMIT 1
INSERT INTO `users` (`email`, `encrypted_password`, `temprorary_password`, `created_at`, `updated_at`, `access_token`) VALUES ('testcard@gmail.com', '$2a$11$uzdHfehgxIr0hWsk1umVm.Y8FMQgAL2KyB1I5dp1EvrcnvsGjsN6i', 1, '2017-03-13 05:36:15', '2017-03-13 05:36:15', '4FB8998E591D0EC7')
SELECT  `users`.* FROM `users`  ORDER BY `users`.`id` DESC LIMIT 1
UPDATE `users` SET `first_name` = 'test', `last_name` = 'card', `zipcode` = '94115', `updated_at` = '2017-03-13 05:36:15' WHERE `users`.`id` = 2